#!/usr/bin/env python3
# -*- coding: utf-8 -*-

h = int(input('Введіть висоту дверей: '))
w = int(input('Введіть ширину дверей: '))

a = int(input('Введіть висоту коробки: '))
b = int(input('Введіть ширину коробки: '))
c = int(input('Введіть довжину коробки: '))

if (a <= h or a<= w) and (b <= h or b<= w):
 print('Ви можете помістити коробку через двері.')
elif  (a <= h or a<= w) and (c <= h or c<= w):
 print('Ви можете помістити коробку через двері.')
elif  (b <= h or b<= w) and (c <= h or c<= w):
 print('Ви можете помістити коробку через двері.')
else:
 print('Ви не можете помістити коробку через двері.')
